encrypt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-04 Wed 10:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Encrypt</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Simon" />
<meta  name="keywords" content="encrypt" />
</head>
<body>
<div id="content">
<h1 class="title">Encrypt</h1>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">1</span> RSA</h2>
<div class="outline-text-2" id="text-1">
</div><ol class="org-ol"><li><a id="orgheadline1"></a>公式和概念<br  /><div class="outline-text-3" id="text-1-1">
<p>
<b>公式：</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">公钥 KU</th>
<th scope="col" class="org-left">n：两个素数p和q的乘积（pq须保密） e：与(p-1)(q-1)互质</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">私钥 KR</td>
<td class="org-left">d：e<sup>-1</sup>(mod(p-1)(q-1)) n:</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">加密</td>
<td class="org-left">c = m<sup>e</sup> mod n (此处为同余运算)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">解密</td>
<td class="org-left">m = c<sup>d</sup> mod n (同上，同余运算)</td>
</tr>
</tbody>
</table>
<p>
<b>概念：</b> 
</p>
<ul class="org-ul">
<li>素数/质数，只能除尽自身和1的数</li>
<li>互质数，公约数只有1的两个数</li>
<li>模运算，如 5 mod 3 = 2，即：两数取余</li>
<li>模质运算，即：先做质数运算，对其结果再做模运算。如5<sup>3</sup> mod 7 = 125 mod 7 = 6</li>
<li>欧拉函数，对于一个正整数 n ，小于 n 且和 n 互质的正整数（包括 1）的个数，记作 φ(n)</li>
<li>模反元素，如：ed ≡ 1 (mod φ(n))，整数d可使ed对f(n)取余为1</li>
<li>费马小定理，假如p是质数，若p不能整除a，则a<sup>(p-1)</sup> ≡ 1 (mod p),若p能整除a，则a<sup>(p-1)</sup> ≡ 0 (mod p)。若p是质数，且a、p互质，那么a的(p-1)次方除以p的余数恒等于1
<ul class="org-ul">
<li><b>证明</b> 因为p是质数，且(a,p) = 1，所以φ(p) = p-1。由欧拉定理可得a<sup>(p-1)</sup> ≡ 1 (mod p)</li>
<li>对于上式又有a<sup>p</sup> ≡ a (mod p)，所以费马小定理的另一种表述为： <b>假如p是质数(素数)，且(a,p) = 1，那么a<sup>p</sup> ≡ a (mod p)</b></li>
</ul></li>
<li><b>欧拉定理</b> ，也称费马-欧拉定理。若n、a为正整数，且n、a互素，即：gcd(a,n) = 1，则：a<sup>φ</sup>(n) ≡ 1 (mod n)</li>
</ul>
</div></li>
<li><a id="orgheadline2"></a>算法步骤<br  /><div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>选择一组大素数p和q -&gt; p=3,q=11</li>
<li>计算n=pq，此处n的二进制格式的bitu位数即是密钥长度。RSA密钥长度一般是1024位，更重要场合使用2048位 -&gt; n = pq = 3*11 = 33</li>
<li>计算欧拉函数 f(n) = (p-1)(q-1) ,此时p和q的值应严格保密 -&gt; f(33) = (3-1)(11-1) = 20</li>
<li>取f(n)的互质数e，满足：1 &lt; e &lt; f(n)，且e与f(n)互质 -&gt; e = 3</li>
<li>计算e对于f(n)的模反元素d的值，ed ≡ 1 (mod f(n)) (“≡”为同余符号) 
<ol class="org-ol">
<li>ed ≡ 1 (mod f(n))</li>
<li>ed ≡ 1 (mod f(n)), 3d ≡ 1 (mod 20)</li>
<li>1 = ed + f(n)y, 3d + 20y = 1</li>
<li>先阶段位通过试数法得：d = 7, y = -1 实际应用中可通过“扩展欧几里得算法”对此二元一次方程求解</li>
</ol></li>
<li>公钥 = (n,e) = (33,3),私钥 = (n,d) = (33,7)</li>
<li>加密：m<sup>e</sup> ≡ c (mod n),m必须为数字，字符串可将其转为ASCII或UNICODE值，且m必须小与n
<ol class="org-ol">
<li>编码明文，我们将“LOVE”加密，ASCII对应的数字为：L = 76，O = 79，V = 86，E = 69</li>
<li>L的密文 76<sup>3</sup> ≡ c (mod 33),438976 ≡ c (mod 33),</li>
</ol></li>
<li>解密：c<sup>d</sup> ≡ m (mod n)
<ol class="org-ol">
<li></li>
</ol></li>
</ol>
</div></li>

<li><a id="orgheadline6"></a>算法实现（C语言）<br  /><ol class="org-ol"><li><a id="orgheadline3"></a>取素数p和q的值<br  /><div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>C语言中超大数值的存储及运算</li>
<li>素性测试</li>
</ul>
</div></li>

<li><a id="orgheadline4"></a>计算欧拉函数值<br  /></li>

<li><a id="orgheadline5"></a>计算模反元素值<br  /></li></ol></li></ol>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Simon</p>
<p class="date">Created: 2015-11-04 Wed 10:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>